//GPAZ99J2 JOB SATOSHI,MSGCLASS=X,CLASS=C,NOTIFY=GPAZ99,TIME=(0,20)
//*****************************************************************
//* LER DADOS DA SYSIN - REGISTRO COM '99...99' INDICA FIM DOS REG.
//*****************************************************************
//STEP1   EXEC PGM=CGPRG007
//STEPLIB DD DSN=GP.GERAL.LOADLIB,DISP=SHR
//SYSIN   DD *
11111SP1500500S97506789
22222SP0750300S38701057
33333RJ0330200N53213841
44444RJ0087000S12470850
11100SP1200200S97006790
11101SP0700300S38001060
55100MG0300200N53003840
55101MG0080100S12000820
99999999999999999999999
//*
