//GPAZ99J2 JOB SATOSHI,MSGCLASS=X,CLASS=C,NOTIFY=GPAZ99,TIME=(0,20)
//*****************************************************************
//* LER DADOS DA SYSIN - REGISTRO COM '99...99' INDICA FIM DOS REG.
//*****************************************************************
//STEP1   EXEC PGM=CGPRG005
//STEPLIB DD DSN=GP.GERAL.LOADLIB,DISP=SHR
//SYSIN   DD *
0014ELIS REGINA         F75MUSICA MPB  08500950
0024ROGERIO CENI        M45FUND.FUTEBOL03500540
0034MARIA ESTHER BUENO  F80TENIS CAMPO 08000850
0044REI PELE            M75FUND.FUTEBOL09800870
0045AYRTON SENNA        M55CORRIDAS F1 10000950
99999999999999999999999999999999999999999999999
//*
