//GPAZ99J2 JOB SATOSHI,MSGCLASS=X,CLASS=C,NOTIFY=GPAZ99,TIME=(0,20)
//*****************************************************************
//* LER DADOS DA SYSIN - REGISTRO COM '99...99' INDICA FIM DOS REG.
//*****************************************************************
//STEP1   EXEC PGM=CGPRG005
//STEPLIB DD DSN=GP.GERAL.LOADLIB,DISP=SHR
//SYSIN   DD *
0014MARIA DAS GRACAS    F17INFORMATICA 08500650
0024FERNANDO RODRIGUES  M23ANALISE.SIST07300840
0034SUELI MATHIAS       F28ENGENHEIRA  08000850
0044CASSIO DE SOUZA     M20MATEMATICA  05500750
0045JOSE DA SILVA LIMA  M19INFORMATIVA 06000500
0064FELIPE RODRIGUES    M21ANALISE SIST09000750
0745TEREZA BATISTA      F19INFORMATICA 09800870
0084ROBERTO BARBOSA     M25ESTATISTICA 05400550
0019DIRCEU DE OLIVEIRA  M28INFORMATICA 04800650
0020VIVIANE SILVEIRA    F22ANALISE SIST08500830
0210ROSA MARIA PADRON   F19ESTATISTICA 04500550
0160ANGELO ROBERTO      M21INFORMATICA 08500890
99999999999999999999999999999999999999999999999
//*
